ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_aios.c
/***************************************************************************//**
* \file cy_ble_aios.c
* \version 2.0
*
* \brief
*  Contains the source code for Automation Input Output Service.
*
********************************************************************************
* \copyright
* Copyright 2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/


#include "cy_ble_event_handler.h"

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

#if (CY_BLE_MODE_PROFILE && defined(CY_BLE_AIOS))

#ifdef CY_BLE_AIOS_SERVER
static cy_ble_gatt_db_attr_handle_t cy_ble_aiossReqHandle;
#endif /* CY_BLE_AIOS_SERVER */

#ifdef CY_BLE_AIOS_CLIENT
static cy_ble_gatt_db_attr_handle_t cy_ble_aioscReqHandle[CY_BLE_CONFIG_GATTC_COUNT];
uint8_t cy_ble_aioscActiveCharIndex[CY_BLE_CONFIG_GATTC_COUNT] = { 0u };
uint8_t cy_ble_aioscActiveCharInstance[CY_BLE_CONFIG_GATTC_COUNT] = { 0u };
uint8_t cy_ble_aioscPrevCharInstIndex[CY_BLE_CONFIG_GATTC_COUNT] = { 0u };
#endif /* (CY_BLE_AIOS_CLIENT) */

static cy_ble_callback_t Cy_BLE_AIOS_ApplCallback = NULL;

/* The pointer on global BLE AIOS Config structure */
cy_stc_ble_aios_config_t *cy_ble_aiosConfigPtr = NULL;

/***************************************
* Private Function Prototypes
***************************************/
#ifdef CY_BLE_AIOS_SERVER
static cy_en_ble_gatt_err_code_t Cy_BLE_AIOSS_WriteEventHandler(cy_stc_ble_gatts_write_cmd_req_param_t *eventParam);
static void Cy_BLE_AIOSS_ConfirmationEventHandler(const cy_stc_ble_conn_handle_t *eventParam);
static cy_en_ble_gatt_err_code_t Cy_BLE_AIOS_SetAggregateChar(void);
#endif /* CY_BLE_AIOS_SERVER */

#ifdef CY_BLE_AIOS_CLIENT
static void Cy_BLE_AIOSC_DiscoverCharacteristicsEventHandler(const cy_stc_ble_disc_char_info_t *discCharInfo);
static void Cy_BLE_AIOSC_DiscoverCharDescriptorsEventHandler(cy_stc_ble_disc_descr_info_t *discDescrInfo);
static void Cy_BLE_AIOSC_GetCharRange(cy_stc_ble_disc_range_info_t *charRangeInfo);
static void Cy_BLE_AIOSC_ReadResponseEventHandler(cy_stc_ble_gattc_read_rsp_param_t *eventParam);
static void Cy_BLE_AIOSC_WriteResponseEventHandler(const cy_stc_ble_conn_handle_t *eventParam);
static void Cy_BLE_AIOSC_ErrorResponseEventHandler(const cy_stc_ble_gatt_err_param_t *eventParam);
static void Cy_BLE_AIOSC_NotificationEventHandler(cy_stc_ble_gattc_handle_value_ntf_param_t *eventParam);
static void Cy_BLE_AIOSC_IndicationEventHandler(cy_stc_ble_gattc_handle_value_ind_param_t *eventParam);
#endif /* CY_BLE_AIOS_CLIENT */

static cy_en_ble_gatt_err_code_t Cy_BLE_AIOS_EventHandler(uint32_t eventCode, void *eventParam);


/******************************************************************************
* Function Name: Cy_BLE_AIOS_Init
***************************************************************************//**
*
*  This function initializes the Automation IO Service.
*  \param config: Configuration structure for the Environmental Sensing Service.
*
*  \return
*  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*  failed. The following are possible error codes.
*
*   Error Codes                             | Description
*   ------------                            | -----------
*   CY_BLE_SUCCESS                          | The function completed successfully.
*   CY_BLE_ERROR_INVALID_PARAMETER          | On specifying NULL as input parameter
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED   | Buffer overflow in the registration callback.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_AIOS_Init(cy_stc_ble_aios_config_t *config)
{
    cy_en_ble_api_result_t apiResult;

    if(config == NULL)
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else
    {
        /* Registers a pointer to config structure */
        cy_ble_aiosConfigPtr = config;

        /* Registers Event Handler for the AIOS Service */
        apiResult = Cy_BLE_RegisterServiceEventHandler(&Cy_BLE_AIOS_EventHandler);

        /* Registers a callback function via config structure */
        if(cy_ble_aiosConfigPtr->callbackFunc != NULL)
        {
            Cy_BLE_AIOS_ApplCallback = cy_ble_aiosConfigPtr->callbackFunc;
        }

    #ifdef CY_BLE_AIOS_SERVER
        cy_ble_aiossReqHandle = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
        (void)Cy_BLE_AIOS_SetAggregateChar();
    #endif /* CY_BLE_AIOS_SERVER */

    #ifdef CY_BLE_AIOS_CLIENT
        {
            uint32_t idx;
            for(idx = 0u; idx < CY_BLE_CONFIG_GATTC_COUNT; idx++)
            {
                uint32_t i;
                uint32_t j;

                if(cy_ble_serverInfo[idx][CY_BLE_SRVI_AIOS].range.startHandle == CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
                {
                    for(i = 0u; (i < (uint32_t)CY_BLE_AIOS_CHAR_COUNT); i++)
                    {
                        for(j = 0u; j < cy_ble_aiosConfigPtr->aioscCharInstances[i]; j++)
                        {
                            (void)memset(&cy_ble_aiosConfigPtr->aiosc[idx].charInfoAddr[i].charInfoPtr[j], 0,
                                         sizeof(cy_stc_ble_aiosc_char_t));
                        }
                    }

                    /* initialize uuid  */
                    cy_ble_serverInfo[idx][CY_BLE_SRVI_AIOS].uuid = CY_BLE_UUID_AUTOMATION_INPUT_OUTPUT_SERVICE;
                }

                cy_ble_aioscActiveCharIndex[idx] = 0u;
                cy_ble_aioscActiveCharInstance[idx] = 0u;
                cy_ble_aioscPrevCharInstIndex[idx] = 0u;
                cy_ble_aioscReqHandle[idx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
            }
        }
    #endif /* CY_BLE_AIOS_CLIENT */
    }

    return(apiResult);
}


