ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_aios.c
/******************************************************************************
* Function Name: Cy_BLE_AIOS_RegisterAttrCallback
***************************************************************************//**
*
*  Registers a callback function for service specific attribute operations.
*  Service specific write requests from peer device will not be handled with
*  unregistered callback function.
*
*  \param callbackFunc:  An application layer event callback function to receive
*                 events from the BLE Component. The definition of
*                 cy_ble_callback_t for AIOS Service is:\n
*                 typedef void (* cy_ble_callback_t) (uint32_t eventCode,
*                                                    void *eventParam)
*                 * eventCode:  Indicates the event that triggered this callback
*                   (e.g. CY_BLE_EVT_AIOS_NOTIFICATION_ENABLED).
*                 * eventParam: Contains the parameters corresponding to the
*                   current event. (e.g. Pointer to cy_stc_ble_aios_char_value_t
*                   structure that contains details of the characteristic
*                   for which the notification enabled event was triggered).
*
* \return
*  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*  failed. The following are possible error codes:
*
*   Error Codes                             | Description
*   ------------                            | -----------
*   CY_BLE_SUCCESS                          | The function completed successfully.
*   CY_BLE_ERROR_INVALID_OPERATION          | This operation is not permitted
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_AIOS_RegisterAttrCallback(cy_ble_callback_t callbackFunc)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_SUCCESS;
    
    Cy_BLE_AIOS_ApplCallback = callbackFunc;
    if(cy_ble_aiosConfigPtr != NULL)
    {
        cy_ble_aiosConfigPtr->callbackFunc = callbackFunc;
    }
    else
    {
        apiResult = CY_BLE_ERROR_INVALID_OPERATION;
    }
    
    return(apiResult);
}

#ifdef CY_BLE_AIOS_SERVER

/******************************************************************************
* Function Name: Cy_BLE_AIOSS_WriteEventHandler
***************************************************************************//**
*
*  Handles the Write Request Event.
*
*  \param eventParam: The pointer to the data structure specified by the event.
*
* \return
*  cy_en_ble_gatt_err_code_t - A function result state if the it succeeded
*  (CY_BLE_GATT_ERR_NONE) or failed with error codes:
*   * CY_BLE_GATTS_ERR_PROCEDURE_ALREADY_IN_PROGRESS - profile or service
*                           request cannot be serviced because an operation that
*                           has been previously triggered is still in progress.
*   * CY_BLE_GATTS_ERR_CCCD_IMPROPERLY_CONFIGURED - Client Characteristic Configuration
*                           descriptor is not configured according to the requirements
*                           of the profile or service.
*
******************************************************************************/
static cy_en_ble_gatt_err_code_t Cy_BLE_AIOSS_WriteEventHandler(cy_stc_ble_gatts_write_cmd_req_param_t *eventParam)
{
    cy_en_ble_gatt_err_code_t gattErr = CY_BLE_GATT_ERR_NONE;
    cy_ble_gatt_db_attr_handle_t tmpHandle;
    cy_stc_ble_aioss_char_t *aiosCharInfoPtr;
    cy_stc_ble_aios_descr_value_t wrDescrReqParam;
    cy_stc_ble_aios_char_value_t wrCharReqParam;
    uint32_t descInd;
    uint32_t event = 0u;
    uint32_t foundItem = CY_BLE_AIOS_UNDEFINED_ITEM;
    uint8_t i;
    uint8_t j;

    tmpHandle = eventParam->handleValPair.attrHandle;

    if(Cy_BLE_AIOS_ApplCallback != NULL)
    {
        /* Go through all possible Service characteristics.
         * Exit the handler in following conditions:
         * 1) No more characteristic left;
         * 2) Characteristic or descriptor was successfully written;
         * 3) Error occurred while writing characteristic or descriptor.
         */
        for(i = 0u; ((i < ((uint8_t)CY_BLE_AIOS_CHAR_COUNT)) && (foundItem == 0u) && (gattErr == CY_BLE_GATT_ERR_NONE));
            i++)
        {
            /* Check if characteristic is enabled. If the pointer to the characteristic
             * is not "NULL", there is at least one instance of the characteristic in
             * the AIO Service.
             */

            if(cy_ble_aiosConfigPtr->aioss->charInfoAddr[i].charInfoPtr != NULL)
            {
                for(j = 0u; j < cy_ble_aiosConfigPtr->aiossCharInstances[i]; j++)
                {
                    aiosCharInfoPtr = &cy_ble_aiosConfigPtr->aioss->charInfoAddr[i].charInfoPtr[j];

                    /* Client Characteristic Write Request handling */
                    if(tmpHandle == aiosCharInfoPtr->charHandle)
                    {
                        wrDescrReqParam.descrIndex = CY_BLE_AIOS_DESCR_COUNT;
                        foundItem = CY_BLE_AIOS_CHARACTERISTIC_ITEM;
                    }

                    /* Client Characteristic Descriptor Write Request handling */
                    else
                    {
                        wrDescrReqParam.descrIndex = CY_BLE_AIOS_DESCR_COUNT;

                        for(descInd = 0u; (descInd < (uint32_t)CY_BLE_AIOS_DESCR_COUNT) &&
                            (foundItem != CY_BLE_AIOS_DESCRIPTOR_ITEM); descInd++)
                        {
                            if(aiosCharInfoPtr->descrHandle[descInd] == tmpHandle)
                            {
                                wrDescrReqParam.descrIndex = (cy_en_ble_aios_descr_index_t)descInd;
                                foundItem = CY_BLE_AIOS_DESCRIPTOR_ITEM;
                            }
                        }
                    }

                    /* Verify if requested handle was found and successfully handled */
                    if((gattErr == CY_BLE_GATT_ERR_NONE) && (foundItem == CY_BLE_AIOS_DESCRIPTOR_ITEM))
                    {
                        switch(wrDescrReqParam.descrIndex)
                        {
                            case CY_BLE_AIOS_CCCD:
                                /* Verify that optional notification property is enabled for characteristic */
                                if(CY_BLE_IS_NOTIFICATION_SUPPORTED(aiosCharInfoPtr->charHandle))
                                {
                                    if(CY_BLE_IS_NOTIFICATION_ENABLED_IN_PTR(eventParam->handleValPair.value.val))
                                    {
                                        event = (uint32_t)CY_BLE_EVT_AIOSS_NOTIFICATION_ENABLED;
                                    }
                                    else
                                    {
                                        event = (uint32_t)CY_BLE_EVT_AIOSS_NOTIFICATION_DISABLED;
                                    }

