ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_aios.c
                            #if ((CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL) && \
                                    (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES))
                                    /* Set a flag to store bonding data to flash */
                                    if(cy_ble_peerBonding[eventParam->connHandle.attId] == CY_BLE_GAP_BONDING)
                                    {
                                        cy_ble_pendingFlashWrite |= CY_BLE_PENDING_CCCD_FLASH_WRITE_BIT;
                                    }
                            #endif /* (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES) */
                                }
                                else if(CY_BLE_IS_INDICATION_SUPPORTED(aiosCharInfoPtr->charHandle))
                                {
                                    if(CY_BLE_IS_INDICATION_ENABLED_IN_PTR(eventParam->handleValPair.value.val))
                                    {
                                        event = (uint32_t)CY_BLE_EVT_AIOSS_INDICATION_ENABLED;
                                    }
                                    else
                                    {
                                        event = (uint32_t)CY_BLE_EVT_AIOSS_INDICATION_DISABLED;
                                    }

                            #if ((CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL) && \
                                    (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES))
                                    /* Set a flag to store bonding data to flash */
                                    if(cy_ble_peerBonding[eventParam->connHandle.attId] == CY_BLE_GAP_BONDING)
                                    {
                                        cy_ble_pendingFlashWrite |= CY_BLE_PENDING_CCCD_FLASH_WRITE_BIT;
                                    }
                            #endif /* (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES) */
                                }
                                else
                                {
                                    gattErr = CY_BLE_GATT_ERR_REQUEST_NOT_SUPPORTED;
                                }
                                break;

                            case CY_BLE_AIOS_CHAR_USER_DESCRIPTION_DESCR:
                                if(CY_BLE_GATT_DB_ATTR_GET_ATTR_GEN_MAX_LEN(
                                       aiosCharInfoPtr->descrHandle[CY_BLE_AIOS_CHAR_USER_DESCRIPTION_DESCR]) >=
                                   eventParam->handleValPair.value.len)
                                {
                                    /* Set new length of the descriptor value */
                                    CY_BLE_GATT_DB_ATTR_SET_ATTR_GEN_LEN(
                                        aiosCharInfoPtr->descrHandle[CY_BLE_AIOS_CHAR_USER_DESCRIPTION_DESCR],
                                        eventParam->handleValPair.value.len);
                                }
                                else
                                {
                                    gattErr = CY_BLE_GATT_ERR_INVALID_ATTRIBUTE_LEN;
                                }
                                break;

                            case CY_BLE_AIOS_VALUE_TRIGGER_SETTINGS:
                                /* Trigger condition value not supported.*/
                                if(eventParam->handleValPair.value.val[0u] >= CY_BLE_AIOS_VALUE_TRIGGER_DESCR_MAX_VALUE)
                                {
                                    gattErr =
                                        (cy_en_ble_gatt_err_code_t)CY_BLE_GATT_ERR_TRIGGER_CODITION_VALUE_NOT_SUPPORTED;
                                }
                                break;

                            case CY_BLE_AIOS_TIME_TRIGGER_SETTINGS:
                                /* Trigger condition value not supported.*/
                                if(eventParam->handleValPair.value.val[0u] >= CY_BLE_AIOS_TIME_TRIGGER_DESCR_MAX_VALUE)
                                {
                                    gattErr =
                                        (cy_en_ble_gatt_err_code_t)CY_BLE_GATT_ERR_TRIGGER_CODITION_VALUE_NOT_SUPPORTED;
                                }
                                break;

                            default:
                                break;
                        }
                    }

                    /* Check is there no error conditions happen yet */
                    if((gattErr == CY_BLE_GATT_ERR_NONE)
                       && ((foundItem == CY_BLE_AIOS_CHARACTERISTIC_ITEM) || (foundItem == CY_BLE_AIOS_DESCRIPTOR_ITEM)))
                    {
                        cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
                        {
                            .handleValuePair = eventParam->handleValPair,
                            .connHandle      = eventParam->connHandle,
                            .offset          = 0u,
                            .flags           = CY_BLE_GATT_DB_PEER_INITIATED
                        };

                        gattErr =
                            Cy_BLE_GATT_DbCheckPermission(eventParam->handleValPair.attrHandle,
                                                          &eventParam->connHandle,
                                                          CY_BLE_GATT_DB_WRITE | CY_BLE_GATT_DB_PEER_INITIATED);

                        if(gattErr == CY_BLE_GATT_ERR_NONE)
                        {
                            /* Fill data and pass it to user */

                            if(foundItem == CY_BLE_AIOS_CHARACTERISTIC_ITEM)
                            {
                                wrCharReqParam.connHandle = eventParam->connHandle;
                                wrCharReqParam.charIndex = (cy_en_ble_aios_char_index_t)i;
                                wrCharReqParam.charInstance = j;
                                wrCharReqParam.gattErrorCode = CY_BLE_GATT_ERR_NONE;
                                wrCharReqParam.value = &eventParam->handleValPair.value;

                                Cy_BLE_AIOS_ApplCallback((uint32_t)CY_BLE_EVT_AIOSS_WRITE_CHAR, &wrCharReqParam);
                            }
                            else if(foundItem == CY_BLE_AIOS_DESCRIPTOR_ITEM)
                            {
                                wrDescrReqParam.connHandle = eventParam->connHandle;
                                wrDescrReqParam.charIndex = (cy_en_ble_aios_char_index_t)i;
                                wrDescrReqParam.charInstance = j;
                                wrDescrReqParam.gattErrorCode = CY_BLE_GATT_ERR_NONE;
                                wrDescrReqParam.value = &eventParam->handleValPair.value;

                                Cy_BLE_AIOS_ApplCallback((uint32_t)CY_BLE_EVT_AIOSS_DESCR_WRITE, &wrDescrReqParam);
                            }
                            else
                            {
                                /* No handle match was found */
                            }

                            /* Write value to GATT database */
                            gattErr = Cy_BLE_GATTS_WriteAttributeValueCCCD(&dbAttrValInfo); \
                            if(event != 0u)
                            {
                                Cy_BLE_AIOS_ApplCallback(event, &wrDescrReqParam);
                            }
                            else
                            {
                                /* No event was found */
                            }
                        }
                        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                        break;
                    }
                }
            }
        }
    }

    if(gattErr != CY_BLE_GATT_ERR_NONE)
    {
        /* Indicate that request was handled */
        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
    }
    else
    {
        if(foundItem == CY_BLE_AIOS_CHARACTERISTIC_ITEM)
        {
            gattErr = Cy_BLE_AIOS_SetAggregateChar();
        }
    }

    return(gattErr);
}

