ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_aios.c
/******************************************************************************
* Function Name: Cy_BLE_AIOSS_SetCharacteristicValue
***************************************************************************//**
*
*  Sets the characteristic value of the service in the local database.
*
*  \param charIndex: The index of the service characteristic. Starts with zero.
*  \param charInstance: The instance number of the characteristic specified by
*                "charIndex".
*  \param attrSize: The size (in bytes) of the characteristic value attribute.
*  \param attrValue: The pointer to the characteristic value data that should be
*             stored in the GATT database.
*
* \return
*  A return value is of type cy_en_ble_api_result_t.
*  * CY_BLE_SUCCESS - The request handled successfully.
*  * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameter failed.
*  * CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE - An optional characteristic is
*                                               absent.
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_AIOSS_SetCharacteristicValue(cy_en_ble_aios_char_index_t charIndex,
                                                           uint8_t charInstance,
                                                           uint8_t attrSize,
                                                           uint8_t *attrValue)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_ERROR_INVALID_PARAMETER;

    /* Validate range of AIOS characteristics */
    if((charIndex < CY_BLE_AIOS_CHAR_COUNT) && (charInstance < cy_ble_aiosConfigPtr->aiossCharInstances[charIndex]))
    {
        /* Check if requested characteristic is present in Service.
         * There are three conditions which should be checked: 1) The pointer to
         * "CY_BLE_AIOS_CHAR_T" is not NULL, 2) The handle of the characteristic is
         * a valid handle, 3) The requested instance is a valid characteristic
         * instance.
         */
        if((cy_ble_aiosConfigPtr->aioss->charInfoAddr[charIndex].charInfoPtr != NULL) &&
           (cy_ble_aiosConfigPtr->aioss->charInfoAddr[charIndex].charInfoPtr[charInstance].charHandle !=
            CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE))
        {
            cy_stc_ble_gatt_handle_value_pair_t locHandleValuePair =
            {
                .attrHandle = cy_ble_aiosConfigPtr->aioss->charInfoAddr[charIndex].charInfoPtr[charInstance].charHandle,
                .value.len  = attrSize,
                .value.val  = attrValue,
            };

            cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
            {
                .handleValuePair = locHandleValuePair,
                .offset          = 0u,
                .flags           = CY_BLE_GATT_DB_LOCALLY_INITIATED
            };
            /* Store data in database */
            if(Cy_BLE_GATTS_WriteAttributeValue(&dbAttrValInfo) == CY_BLE_GATT_ERR_NONE)
            {
                apiResult = CY_BLE_SUCCESS;
            }
        }
        else
        {
            apiResult = CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE;
        }
    }

    if(apiResult == CY_BLE_SUCCESS)
    {
        apiResult = (cy_en_ble_api_result_t)Cy_BLE_AIOS_SetAggregateChar();
    }

    return(apiResult);
}

/******************************************************************************
* Function Name: Cy_BLE_AIOSS_GetCharacteristicValue
***************************************************************************//**
*
*  Gets the characteristic value of the service, which is a value identified by
*  charIndex.
*
*  \param charIndex: The index of the service characteristic. Starts with zero.
*  \param charInstance: The instance number of the characteristic specified by
*                "charIndex".
*  \param attrSize: The size of the characteristic value attribute.
*  \param attrValue: The pointer to the location where characteristic value data
*             should be stored.
*
* \return
*  A return value is of type cy_en_ble_api_result_t.
*  * CY_BLE_SUCCESS - The request handled successfully
*  * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameter failed
*  * CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE - An optional characteristic is
*                                               absent.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_AIOSS_GetCharacteristicValue(cy_en_ble_aios_char_index_t charIndex,
                                                           uint8_t charInstance,
                                                           uint8_t attrSize,
                                                           uint8_t *attrValue)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_ERROR_INVALID_PARAMETER;

    if((charIndex < CY_BLE_AIOS_CHAR_COUNT) && (charInstance < cy_ble_aiosConfigPtr->aiossCharInstances[charIndex]))
    {
        /* Check if requested characteristic is present in Service. There are three
         * conditions to be checked: 1) The pointer to "cy_stc_ble_aioss_char_t" record in
         * the cy_ble_aioss struct is not NULL, 2) The handle of the characteristic is a
         * valid handle, 3) The requested instance is a valid characteristic instance.
         */
        if((cy_ble_aiosConfigPtr->aioss->charInfoAddr[charIndex].charInfoPtr != NULL) &&
           (cy_ble_aiosConfigPtr->aioss->charInfoAddr[charIndex].charInfoPtr[charInstance].charHandle !=
            CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE))
        {
            cy_stc_ble_gatt_handle_value_pair_t locHandleValuePair =
            {
                .attrHandle = cy_ble_aiosConfigPtr->aioss->charInfoAddr[charIndex].charInfoPtr[charInstance].charHandle,
                .value.len  = attrSize,
                .value.val  = attrValue,
            };

            cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
            {
                .handleValuePair = locHandleValuePair,
                .offset          = 0u,
                .flags           = CY_BLE_GATT_DB_LOCALLY_INITIATED
            };

