ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_aios.c
            /* Read characteristic value from database */
            if(Cy_BLE_GATTS_ReadAttributeValue(&dbAttrValInfo) == CY_BLE_GATT_ERR_NONE)
            {
                apiResult = CY_BLE_SUCCESS;

                /* Set new length of the descriptor value */
                CY_BLE_GATT_DB_ATTR_SET_ATTR_GEN_LEN(cy_ble_aiosConfigPtr->aioss->charInfoAddr[charIndex].
                                                      charInfoPtr[charInstance].charHandle, attrSize);
            }
        }
        else
        {
            apiResult = CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE;
        }
    }

    return(apiResult);
}

/******************************************************************************
* Function Name: Cy_BLE_AIOSS_GetCharacteristicDescriptor
***************************************************************************//**
*
*  Gets a characteristic descriptor of a specified characteristic of the
*  Automation Input Output Service from the local GATT database.
*
*  \param connHandle: The connection handle.
*  \param charIndex: The index of the characteristic.
*  \param charInstance: The instance number of the characteristic specified by
*                "charIndex".
*  \param descrIndex: The index of the characteristic descriptor.
*  \param attrSize: The size of the characteristic descriptor attribute.
*  \param attrValue: The pointer to the location where characteristic descriptor
*               value data should be stored.
*
* \return
*  Return value is of type cy_en_ble_api_result_t.
*  * CY_BLE_SUCCESS - The request handled successfully
*  * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameter failed
*  * CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE - Optional descriptor is absent
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_AIOSS_GetCharacteristicDescriptor(cy_stc_ble_conn_handle_t connHandle,
                                                                cy_en_ble_aios_char_index_t charIndex,
                                                                uint8_t charInstance,
                                                                cy_en_ble_aios_descr_index_t descrIndex,
                                                                uint8_t attrSize,
                                                                uint8_t *attrValue)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_ERROR_INVALID_PARAMETER;

    if((charIndex < CY_BLE_AIOS_CHAR_COUNT) && (charInstance < cy_ble_aiosConfigPtr->aiossCharInstances[charIndex]) &&
       (descrIndex < CY_BLE_AIOS_DESCR_COUNT))
    {
        /* Check if requested descriptor is present in Service.
         * There are three conditions to be checked: 1) The pointer to
         * "CY_BLE_AiosS_CHAR_T" is not NULL, 2) The handle of the characteristic is
         * a valid handle, 3) The handle of the descriptor is a valid handle.
         */
        if((cy_ble_aiosConfigPtr->aioss->charInfoAddr[charIndex].charInfoPtr != NULL) &&
           (cy_ble_aiosConfigPtr->aioss->charInfoAddr[charIndex].charInfoPtr[charInstance].charHandle !=
            CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE) &&
           (cy_ble_aiosConfigPtr->aioss->charInfoAddr[charIndex].charInfoPtr[charInstance].descrHandle[descrIndex] !=
            CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE))
        {
            cy_stc_ble_gatt_handle_value_pair_t locHandleValuePair =
            {
                .attrHandle = cy_ble_aiosConfigPtr->aioss->charInfoAddr[charIndex].charInfoPtr[charInstance].
                               descrHandle[descrIndex],
                .value.len  = attrSize,
                .value.val  = attrValue,
            };

            cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
            {
                .handleValuePair = locHandleValuePair,
                .connHandle      = connHandle,
                .offset          = 0u,
                .flags           = CY_BLE_GATT_DB_LOCALLY_INITIATED
            };

            /* Read characteristic value from database */
            if(Cy_BLE_GATTS_ReadAttributeValueCCCD(&dbAttrValInfo) ==
               CY_BLE_GATT_ERR_NONE)
            {
                apiResult = CY_BLE_SUCCESS;

                /* Set new length of the descriptor value */
                CY_BLE_GATT_DB_ATTR_SET_ATTR_GEN_LEN(cy_ble_aiosConfigPtr->aioss->charInfoAddr[charIndex].
                                                      charInfoPtr[charInstance].descrHandle[descrIndex], attrSize);
            }
        }
        else
        {
            apiResult = CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE;
        }
    }

    return(apiResult);
}

/******************************************************************************
* Function Name: Cy_BLE_AIOSS_SetCharacteristicDescriptor
***************************************************************************//**
*
*  Set a characteristic descriptor of a specified characteristic of the Indoor
*  Positioning Service from the local GATT database.
*
*  \param connHandle: The connection handle.
*  \param charIndex: The index of the characteristic.
*  \param charInstance: The instance number of the characteristic specified by
*                "charIndex".
*  \param descrIndex: The index of the characteristic descriptor.
*  \param attrSize: The size of the characteristic descriptor attribute.
*  \param attrValue: The pointer to the descriptor value data to
*             be stored in the GATT database.
*
* \return
*  Return value is of type cy_en_ble_api_result_t.
*  * CY_BLE_SUCCESS - The request handled successfully
*  * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameter failed
*  * CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE - Optional descriptor is absent
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_AIOSS_SetCharacteristicDescriptor(cy_stc_ble_conn_handle_t connHandle,
                                                                cy_en_ble_aios_char_index_t charIndex,
                                                                uint8_t charInstance,
                                                                cy_en_ble_aios_descr_index_t descrIndex,
                                                                uint8_t attrSize,
                                                                uint8_t *attrValue)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_ERROR_INVALID_PARAMETER;

    if((charIndex < CY_BLE_AIOS_CHAR_COUNT) && (charInstance < cy_ble_aiosConfigPtr->aiossCharInstances[charIndex]) &&
       (descrIndex < CY_BLE_AIOS_DESCR_COUNT))
    {
        /* Check if requested descriptor is present in Service.
         * There are three conditions to be checked: 1) The pointer to
         * "CY_BLE_AiosS_CHAR_T" is not NULL, 2) The handle of the characteristic is
         * a valid handle, 3) The handle of the descriptor is a valid handle.
         */
        if((cy_ble_aiosConfigPtr->aioss->charInfoAddr[charIndex].charInfoPtr != NULL) &&
           (cy_ble_aiosConfigPtr->aioss->charInfoAddr[charIndex].charInfoPtr[charInstance].charHandle !=
            CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE) &&
           (cy_ble_aiosConfigPtr->aioss->charInfoAddr[charIndex].charInfoPtr[charInstance].descrHandle[descrIndex] !=
            CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE))
        {
            cy_stc_ble_gatt_handle_value_pair_t locHandleValuePair =
            {
                .attrHandle = cy_ble_aiosConfigPtr->aioss->charInfoAddr[charIndex].charInfoPtr[charInstance].
                               descrHandle[descrIndex],
                .value.len  = attrSize,
                .value.val  = attrValue
            };

