ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_aios.c
/******************************************************************************
* Function Name: Cy_BLE_AIOSS_ConfirmationEventHandler
***************************************************************************//**
*
*  Handles a Value Confirmation request event from the BLE stack.
*
*  eventParam - The pointer to a structure of type cy_stc_ble_conn_handle_t.
*
******************************************************************************/
static void Cy_BLE_AIOSS_ConfirmationEventHandler(const cy_stc_ble_conn_handle_t *eventParam)
{
    cy_en_ble_aios_char_index_t locCharIndex;
    cy_stc_ble_aios_char_value_t locCharValue;
    uint32_t locReqHandle = 0u;
    uint8_t locCharInstance;

    if((Cy_BLE_AIOS_ApplCallback != NULL) && (cy_ble_aiossReqHandle != CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE))
    {
        for(locCharIndex = CY_BLE_AIOS_DIGITAL; (locCharIndex < CY_BLE_AIOS_CHAR_COUNT) && (locReqHandle == 0u);
            locCharIndex++)
        {
            for(locCharInstance = 0u; (locCharInstance < cy_ble_aiosConfigPtr->aiossCharInstances[locCharIndex]) &&
                (locReqHandle == 0u); locCharInstance++)
            {
                if(cy_ble_aiossReqHandle == cy_ble_aiosConfigPtr->aioss->charInfoAddr[locCharIndex].
                    charInfoPtr[locCharInstance].charHandle)
                {
                    locCharValue.connHandle = *eventParam;
                    locCharValue.charIndex = locCharIndex;
                    locCharValue.charInstance = locCharInstance;
                    locCharValue.value = NULL;

                    cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                    cy_ble_aiossReqHandle = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
                    Cy_BLE_AIOS_ApplCallback((uint32_t)CY_BLE_EVT_AIOSS_INDICATION_CONFIRMED, &locCharValue);
                    locReqHandle = 1u;
                }
            }
        }
    }
}

/******************************************************************************
* Function Name: Cy_BLE_AIOS_SetAggregateChar
***************************************************************************//**
*
*  Sets the value for Aggregate characteristic.
*  All of the defined Digital characteristics with the Read property set be
*  part of Aggregate (if available). The length of each of the Digital characteristics
*  that is part of the Aggregate is determined from the number of signals defined in the
*  Number of Digitals descriptor of the Digital characteristic. The Digital part byte
*  aligned and trailing bits (if any) set to 0. The order of the Digital characteristics
*  is determined by the value in the Description field of the Characteristic Presentation
*  Format descriptor with the lowest value first.
*  All of the defined Analog characteristics with Read property set part of the Aggregate
*  (if available). The order of the Analog characteristics is determined by the value in
*  the Description field of the Characteristic Presentation Format descriptor with the
*  lowest value first.
*  The first analog input follows directly after the last Digital characteristic.
*
* \return
*  A return value is of type cy_en_ble_gatt_err_code_t.
*  * CY_BLE_GATT_ERR_NONE - The advertisement packet collected successfully.
*  * CY_BLE_GATT_ERR_INVALID_HANDLE - 'handleValuePair.attrHandle' is not valid.
*  * Other GATT Error codes are specified in 'cy_en_ble_gatt_err_code_t'
*
******************************************************************************/
static cy_en_ble_gatt_err_code_t Cy_BLE_AIOS_SetAggregateChar(void)
{
    cy_en_ble_gatt_err_code_t gattErr = CY_BLE_GATT_ERR_NONE;
    cy_en_ble_aios_char_index_t locCharIndex;
    uint8_t locCharInstance;
    uint8_t locAttrValue[CY_BLE_AIOS_CHAR_PRESENTATION_FORMAT_LEN];
    uint8_t aggregateChar[CY_BLE_GATT_MTU - 3u];
    uint16_t currentDescriptionValue;
    uint16_t minDescriptionValue;
    uint16_t minDescriptionValueTmp = 0xFFFFu;
    uint16_t maxDescriptionValue;
    uint16_t minDescriptionNumber;
    uint8_t locCharInstanceNumber;
    uint8_t aggregateCharIndex = 0u;
    uint8_t aggregateDigitalBits = 0u;
    uint8_t numOfDigital;
    uint8_t i;

    for(i = 0u; i < (CY_BLE_GATT_MTU - 3u); i++)
    {
        aggregateChar[i] = 0u;
    }

    for(i = 0u; i < CY_BLE_AIOS_CHAR_PRESENTATION_FORMAT_LEN; i++)
    {
        locAttrValue[i] = 0u;
    }

    if((cy_ble_aiosConfigPtr->aioss->charInfoAddr[CY_BLE_AIOS_AGGREGATE].charInfoPtr != NULL) &&
       (cy_ble_aiosConfigPtr->aioss->charInfoAddr[CY_BLE_AIOS_AGGREGATE].charInfoPtr[0].charHandle !=
        CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE))
    {
        for(locCharIndex = CY_BLE_AIOS_DIGITAL; (locCharIndex <= CY_BLE_AIOS_ANALOG) && (gattErr == CY_BLE_GATT_ERR_NONE);
            locCharIndex++)
        {
            minDescriptionValue = 0u;
            minDescriptionNumber = 0u;

            for(locCharInstanceNumber = 0u;
                (locCharInstanceNumber < cy_ble_aiosConfigPtr->aiossCharInstances[locCharIndex]) &&
                (gattErr == CY_BLE_GATT_ERR_NONE); locCharInstanceNumber++)
            {
                maxDescriptionValue = CY_BLE_AIOS_MAX_CHAR_DESCRIPTION_VALUE;

                for(locCharInstance = 0u;
                    (locCharInstance < cy_ble_aiosConfigPtr->aiossCharInstances[locCharIndex]) &&
                    (gattErr == CY_BLE_GATT_ERR_NONE); locCharInstance++)
                {
                    if((cy_ble_aiosConfigPtr->aioss->charInfoAddr[locCharIndex].charInfoPtr != NULL) &&
                       (cy_ble_aiosConfigPtr->aioss->charInfoAddr[locCharIndex].charInfoPtr[locCharInstance].charHandle
                        != CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE) &&
                       (cy_ble_aiosConfigPtr->aioss->charInfoAddr[locCharIndex].charInfoPtr[locCharInstance].
                         descrHandle[CY_BLE_AIOS_CHAR_PRESENTATION_FORMAT] != CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE))
                    {
                        /* Get characteristic value from GATT database */
                        cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
                        {
                            .handleValuePair.attrHandle = cy_ble_aiosConfigPtr->aioss->charInfoAddr[locCharIndex].
                                                           charInfoPtr[locCharInstance].
                                                           descrHandle[CY_BLE_AIOS_CHAR_PRESENTATION_FORMAT],
                            .handleValuePair.value.len  = CY_BLE_AIOS_CHAR_PRESENTATION_FORMAT_LEN,
                            .handleValuePair.value.val  = locAttrValue,
                            .flags                      = CY_BLE_GATT_DB_LOCALLY_INITIATED
                        };
                        gattErr = Cy_BLE_GATTS_ReadAttributeValue(&dbAttrValInfo);
                    }
                    else
                    {
                        gattErr = CY_BLE_GATT_ERR_INVALID_HANDLE;
                    }

                    if(gattErr == CY_BLE_GATT_ERR_NONE)
                    {
                        currentDescriptionValue =
                            ((uint16_t)(((uint16_t)locAttrValue[CY_BLE_AIOS_CHAR_PRESENTATION_FORMAT_LEN - 1u]) << 8u)) |
                            ((uint16_t)locAttrValue[CY_BLE_AIOS_CHAR_PRESENTATION_FORMAT_LEN - 2u]);

                        if((currentDescriptionValue < maxDescriptionValue) &&
                           (currentDescriptionValue > minDescriptionValue))
                        {
                            maxDescriptionValue = currentDescriptionValue;
                            minDescriptionNumber = locCharInstance;
                            minDescriptionValueTmp = currentDescriptionValue;
                        }
                    }
                }

                minDescriptionValue = minDescriptionValueTmp;

                if(locCharIndex == CY_BLE_AIOS_DIGITAL)
                {
                    /* Read descriptor CY_BLE_AIOS_NUM_OF_DIGITAL_DESCR value from database */
                    cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
                    {
                        .handleValuePair.attrHandle = cy_ble_aiosConfigPtr->aioss->charInfoAddr[CY_BLE_AIOS_DIGITAL].
                                                       charInfoPtr[minDescriptionNumber].
                                                       descrHandle[CY_BLE_AIOS_NUM_OF_DIGITAL_DESCR],
                        .handleValuePair.value.len  = CY_BLE_AIOS_NUM_OF_DIGITAL_DESCR_LEN,
                        .handleValuePair.value.val  = &numOfDigital,
                        .flags                      = CY_BLE_GATT_DB_LOCALLY_INITIATED
                    };

