ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_aios.c
                    gattErr = Cy_BLE_GATTS_ReadAttributeValue(&dbAttrValInfo);

                    if(gattErr == CY_BLE_GATT_ERR_NONE)
                    {
                        dbAttrValInfo.handleValuePair.attrHandle =
                            cy_ble_aiosConfigPtr->aioss->charInfoAddr[CY_BLE_AIOS_DIGITAL].
                             charInfoPtr[minDescriptionNumber].descrHandle[CY_BLE_AIOS_NUM_OF_DIGITAL_DESCR];
                        dbAttrValInfo.handleValuePair.value.len = (((uint16_t)(numOfDigital) / 4u) + 1u);
                        dbAttrValInfo.handleValuePair.value.val = &aggregateChar[aggregateCharIndex + 1u];

                        gattErr = Cy_BLE_GATTS_ReadAttributeValue(&dbAttrValInfo);
                        if(gattErr == CY_BLE_GATT_ERR_NONE)
                        {
                            for(i = 0u; i < ((numOfDigital / 4u) + 1u); i++)
                            {
                                aggregateChar[aggregateCharIndex + i] |=
                                    (uint8_t)(aggregateChar[aggregateCharIndex + i + 1u] << aggregateDigitalBits);
                                aggregateChar[aggregateCharIndex + i + 1u] >>= (8u - aggregateDigitalBits);
                            }

                            aggregateCharIndex += (((aggregateDigitalBits / 2u) + numOfDigital) / 4u);
                            aggregateDigitalBits = (((aggregateDigitalBits / 2u) + numOfDigital) % 4u) * 2u;
                        }
                    }
                }
                else if(locCharIndex == CY_BLE_AIOS_ANALOG)
                {
                    /* Read characteristic CY_BLE_AIOS_ANALOG value from database */
                    cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
                    {
                        .handleValuePair.attrHandle = cy_ble_aiosConfigPtr->aioss->charInfoAddr[locCharIndex].
                                                       charInfoPtr[minDescriptionNumber].charHandle,
                        .handleValuePair.value.len  = CY_BLE_AIOS_ANALOG_LEN,
                        .handleValuePair.value.val  = &aggregateChar[aggregateCharIndex],
                        .flags                      = CY_BLE_GATT_DB_LOCALLY_INITIATED
                    };
                    gattErr = Cy_BLE_GATTS_ReadAttributeValue(&dbAttrValInfo);
                    if(gattErr == CY_BLE_GATT_ERR_NONE)
                    {
                        aggregateCharIndex += 2u;
                    }
                }
                else
                {
                    /* Do nothing */
                }
            }
            aggregateCharIndex++;
        }

        if(gattErr == CY_BLE_GATT_ERR_NONE)
        {
            cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
            {
                .handleValuePair.attrHandle = cy_ble_aiosConfigPtr->aioss->charInfoAddr[CY_BLE_AIOS_AGGREGATE].
                                               charInfoPtr[0u].charHandle,
                .handleValuePair.value.len  = aggregateCharIndex - 1u,
                .handleValuePair.value.val  = aggregateChar,
                .flags                      = CY_BLE_GATT_DB_LOCALLY_INITIATED
            };

            /* Store data in database */
            gattErr = Cy_BLE_GATTS_WriteAttributeValue(&dbAttrValInfo);
        }
    }

    return gattErr;
}

#endif /* CY_BLE_AIOS_SERVER */

#ifdef CY_BLE_AIOS_CLIENT

/******************************************************************************
* Function Name: Cy_BLE_AIOSC_DiscoverCharacteristicsEventHandler
***************************************************************************//**
*
*  This function is called on receiving a CY_BLE_EVT_GATTC_FIND_INFO_RSP event.
*  Based on the descriptor UUID, an appropriate data structure is populated using
*  the data received as part of the callback.
*
*  \param discCharInfo: The pointer to a characteristic information structure.
*
******************************************************************************/
static void Cy_BLE_AIOSC_DiscoverCharacteristicsEventHandler(const cy_stc_ble_disc_char_info_t *discCharInfo)
{
    /* AIOS characteristics UUIDs */
    static const cy_ble_uuid16_t cy_ble_AioscCharUuid[CY_BLE_AIOS_CHAR_COUNT] =
    {
        CY_BLE_UUID_CHAR_DIGITAL,
        CY_BLE_UUID_CHAR_ANALOG,
        CY_BLE_UUID_CHAR_AGGREGATE
    };

    static cy_ble_gatt_db_attr_handle_t *lastEndHandle[CY_BLE_CONFIG_GATTC_COUNT] = { NULL };
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(discCharInfo->connHandle);
    uint32_t i;
    uint32_t j;
    uint32_t exitLoop = 0u;

    if((discCharInfo->uuidFormat == CY_BLE_GATT_16_BIT_UUID_FORMAT) &&
       (cy_ble_discovery[discIdx].servCount == (uint32_t)CY_BLE_SRVI_AIOS))
    {
        /* Update last characteristic endHandle to declaration handle of this characteristic */
        if(lastEndHandle[discIdx] != NULL)
        {
            *lastEndHandle[discIdx] = discCharInfo->charDeclHandle - 1u;
            lastEndHandle[discIdx] = NULL;
        }

        /* Search through all available characteristics */
        for(i = 0u; ((i < (uint32_t)CY_BLE_AIOS_CHAR_COUNT) && (exitLoop == 0u)); i++)
        {
            for(j = 0u; j < cy_ble_aiosConfigPtr->aioscCharInstances[i]; j++)
            {
                if(cy_ble_AioscCharUuid[i] == discCharInfo->uuid.uuid16)
                {
                    if(cy_ble_aiosConfigPtr->aiosc[discIdx].charInfoAddr[i].charInfoPtr != NULL)
                    {
                        if(cy_ble_aiosConfigPtr->aiosc[discIdx].charInfoAddr[i].charInfoPtr[j].valueHandle ==
                           CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
                        {
                            cy_ble_aiosConfigPtr->aiosc[discIdx].charInfoAddr[i].charInfoPtr[j].valueHandle =
                                discCharInfo->valueHandle;
                            cy_ble_aiosConfigPtr->aiosc[discIdx].charInfoAddr[i].charInfoPtr[j].properties =
                                discCharInfo->properties;
                            lastEndHandle[discIdx] =
                                &cy_ble_aiosConfigPtr->aiosc[discIdx].charInfoAddr[i].charInfoPtr[j].endHandle;
                            exitLoop = 1u;
                            break;
                        }
                    }
                }
            }
        }

        /* Initialize characteristic endHandle to Service endHandle.
         * Characteristic endHandle will be updated to the declaration
         * handler of the following characteristic,
         * in the following characteristic discovery procedure. */
        if(lastEndHandle[discIdx] != NULL)
        {
            *lastEndHandle[discIdx] = cy_ble_serverInfo[discIdx][cy_ble_discovery[discIdx].servCount].range.endHandle;
        }

        /* Indicate that request was handled */
        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
    }
}


