ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_aios.c
/******************************************************************************
* Function Name: Cy_BLE_AIOSC_DiscoverCharDescriptorsEventHandler
***************************************************************************//**
*
*  This function is called on receiving a CY_BLE_EVT_GATTC_FIND_INFO_RSP event.
*  Based on the descriptor UUID, an appropriate data structure is populated using
*  the data received as part of the callback.
*
*  \param discDescrInfo: The pointer to a descriptor information structure.
*
******************************************************************************/
static void Cy_BLE_AIOSC_DiscoverCharDescriptorsEventHandler(cy_stc_ble_disc_descr_info_t *discDescrInfo)
{
    uint32_t notSupportedDescr = 0u;
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(discDescrInfo->connHandle);
    uint32_t charIdx = cy_ble_discovery[discIdx].charCount;
    uint32_t charInst = cy_ble_aioscActiveCharInstance[discIdx];
    uint32_t descIdx;


    if((cy_ble_discovery[discIdx].servCount == (uint32_t)CY_BLE_SRVI_AIOS) &&
       (cy_ble_aiosConfigPtr->aiosc[discIdx].charInfoAddr[charIdx].charInfoPtr != NULL))
    {
        switch(discDescrInfo->uuid.uuid16)
        {
            case CY_BLE_UUID_CHAR_CLIENT_CONFIG:
                descIdx = (uint32_t)CY_BLE_AIOS_CCCD;
                break;

            case CY_BLE_UUID_CHAR_FORMAT:
                descIdx = (uint32_t)CY_BLE_AIOS_CHAR_PRESENTATION_FORMAT;
                break;

            case CY_BLE_UUID_CHAR_USER_DESCRIPTION:
                descIdx = (uint32_t)CY_BLE_AIOS_CHAR_USER_DESCRIPTION_DESCR;
                break;

            case CY_BLE_UUID_CHAR_EXTENDED_PROPERTIES:
                descIdx = (uint32_t)CY_BLE_AIOS_CHAR_EXTENDED_PROPERTIES;
                break;

            case CY_BLE_UUID_CHAR_VALUE_TRIGGER_SETTING:
                descIdx = (uint32_t)CY_BLE_AIOS_VALUE_TRIGGER_SETTINGS;
                break;

            case CY_BLE_UUID_CHAR_TIME_TRIGGER_SETTING:
                descIdx = (uint32_t)CY_BLE_AIOS_TIME_TRIGGER_SETTINGS;
                break;

            case CY_BLE_UUID_CHAR_VALID_RANGE:
                descIdx = (uint32_t)CY_BLE_AIOS_VRD;
                break;

            case CY_BLE_UUID_CHAR_NUMBER_OF_DIGITALS:
                descIdx = (uint32_t)CY_BLE_AIOS_NUM_OF_DIGITAL_DESCR;
                break;

            default:
                /* Not supported descriptor */
                notSupportedDescr = 1u;
                break;
        }

        if(notSupportedDescr == 0u)
        {
            if(cy_ble_aiosConfigPtr->aiosc[discIdx].charInfoAddr[charIdx].charInfoPtr[charInst].descrHandle[descIdx] ==
               CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
            {
                cy_ble_aiosConfigPtr->aiosc[discIdx].charInfoAddr[charIdx].charInfoPtr[charInst].descrHandle[descIdx] =
                    discDescrInfo->descrHandle;
            }
            else    /* Duplication of descriptor */
            {
                Cy_BLE_ApplCallback((uint32_t)CY_BLE_EVT_GATTC_DESCR_DUPLICATION, &discDescrInfo);
            }
        }

        /* Indicate that request was handled */
        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
    }
}


/******************************************************************************
* Function Name: Cy_BLE_AIOSC_GetCharRange
***************************************************************************//**
*
* Returns a possible range of the current characteristic descriptor via
* input parameter charRangeInfo->range
*
* \param *charRangeInfo: The pointer to a descriptor range information structure.
* \return
*  None.
*
******************************************************************************/
static void Cy_BLE_AIOSC_GetCharRange(cy_stc_ble_disc_range_info_t *charRangeInfo)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(charRangeInfo->connHandle);
    uint32_t exitFlag = 0u;

    if(cy_ble_discovery[discIdx].servCount == (uint32_t)CY_BLE_SRVI_AIOS)
    {
        if(charRangeInfo->srviIncIdx == CY_BLE_DISCOVERY_INIT)
        {
            /* CY_BLE_DISCOVERY_INIT */
            cy_ble_aioscActiveCharInstance[discIdx] = 0u;
        }
        else
        {
            /* CY_BLE_DISCOVERY_CONTINUE */
            cy_ble_aioscActiveCharInstance[discIdx]++;
            if(cy_ble_aioscActiveCharInstance[discIdx] ==
               cy_ble_aiosConfigPtr->aioscCharInstances[cy_ble_discovery[discIdx].charCount])
            {
                cy_ble_discovery[discIdx].charCount++;
                cy_ble_aioscActiveCharInstance[discIdx] = 0u;
            }
        }

        while((cy_ble_discovery[discIdx].charCount < (uint32_t)CY_BLE_AIOS_CHAR_COUNT) && (exitFlag == 0u))
        {
            uint32_t charIdx = cy_ble_discovery[discIdx].charCount;

            while((cy_ble_aioscActiveCharInstance[discIdx] < cy_ble_aiosConfigPtr->aioscCharInstances[charIdx]) &&
                  (exitFlag == 0u))
            {
                uint32_t charInst = cy_ble_aioscActiveCharInstance[discIdx];
                if((cy_ble_aiosConfigPtr->aiosc[discIdx].charInfoAddr[charIdx].charInfoPtr[charInst].valueHandle !=
                    CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE) &&
                   ((cy_ble_aiosConfigPtr->aiosc[discIdx].charInfoAddr[charIdx].charInfoPtr[charInst].endHandle -
                     cy_ble_aiosConfigPtr->aiosc[discIdx].charInfoAddr[charIdx].charInfoPtr[charInst].valueHandle) != 0u))
                {
                    charRangeInfo->range.startHandle =
                        cy_ble_aiosConfigPtr->aiosc[discIdx].charInfoAddr[charIdx].charInfoPtr[charInst].valueHandle + 1u;
                    charRangeInfo->range.endHandle =
                        cy_ble_aiosConfigPtr->aiosc[discIdx].charInfoAddr[charIdx].charInfoPtr[charInst].endHandle;
                    exitFlag = 1u;
                }
                else
                {
                    cy_ble_aioscActiveCharInstance[discIdx]++;
                }
            }
            if(exitFlag == 0u)
            {
                cy_ble_discovery[discIdx].charCount++;
                cy_ble_aioscActiveCharInstance[discIdx] = 0u;
            }
        }

        /* Indicate that request was handled */
        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
    }
}


