ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_aios.c
                        for(locDescIndex = CY_BLE_AIOS_CCCD; (locDescIndex < CY_BLE_AIOS_DESCR_COUNT) &&
                            (locReqHandle == 0u); locDescIndex++)
                        {
                            if(cy_ble_aioscReqHandle[discIdx] == cy_ble_aiosConfigPtr->aiosc[discIdx].
                                charInfoAddr[locCharIndex].charInfoPtr[j].
                                descrHandle[locDescIndex])
                            {
                                cy_stc_ble_aios_descr_value_t locDescrValue =
                                {
                                    .connHandle   = eventParam->connHandle,
                                    .charIndex    = locCharIndex,
                                    .descrIndex   = locDescIndex,
                                    .charInstance = j,
                                    .value        = &eventParam->value
                                };

                                cy_ble_aioscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
                                Cy_BLE_AIOS_ApplCallback((uint32_t)CY_BLE_EVT_AIOSC_READ_DESCR_RESPONSE, &locDescrValue);
                                locReqHandle = 1u;
                            }
                        }
                    }
                }
            }
        }
        if(locReqHandle != 0u)
        {
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
        }
    }
}

/******************************************************************************
* Function Name: Cy_BLE_AIOSC_WriteResponseEventHandler
***************************************************************************//**
*
*  Handles a Write Response event for the Automation IO Service.
*
*  \param eventParam: The pointer to a data structure specified by an event.
*
******************************************************************************/
static void Cy_BLE_AIOSC_WriteResponseEventHandler(const cy_stc_ble_conn_handle_t *eventParam)
{
    uint8_t j;
    uint32_t locReqHandle = 0u;
    cy_en_ble_aios_char_index_t locCharIndex;


    /* Check if service handler was registered and request handle is
     * valid.
     */
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(*eventParam);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_AIOS_ApplCallback != NULL) &&
       (cy_ble_aioscReqHandle[discIdx] != CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE))
    {
        for(locCharIndex = CY_BLE_AIOS_DIGITAL; (locCharIndex < CY_BLE_AIOS_CHAR_COUNT) &&
            (locReqHandle == 0u); locCharIndex++)
        {
            /* If this condition is false, this means that the current characteristic
             * is not included in the GUI, in other words support for the characteristic is
             * not enabled.
             */
            if(cy_ble_aiosConfigPtr->aiosc[discIdx].charInfoAddr[locCharIndex].charInfoPtr != NULL)
            {
                for(j = 0u; ((j < cy_ble_aiosConfigPtr->aioscCharInstances[locCharIndex]) && (locReqHandle == 0u)); j++)
                {
                    cy_stc_ble_aios_descr_value_t locDescrValue =
                    {
                        .connHandle   = *eventParam,
                        .charIndex    = locCharIndex,
                        .charInstance = j,
                        .value        = NULL
                    };
                    /* Check if requested descriptor handle is in
                     * characteristic range.
                     */

                    if((cy_ble_aiosConfigPtr->aiosc[discIdx].charInfoAddr[locCharIndex].charInfoPtr[j].valueHandle <
                        cy_ble_aioscReqHandle[discIdx]) &&
                       (cy_ble_aiosConfigPtr->aiosc[discIdx].charInfoAddr[locCharIndex].charInfoPtr[j].endHandle >=
                        cy_ble_aioscReqHandle[discIdx]))
                    {
                        if(cy_ble_aioscReqHandle[discIdx] ==
                           cy_ble_aiosConfigPtr->aiosc[discIdx].charInfoAddr[locCharIndex].charInfoPtr[j].
                            descrHandle[CY_BLE_AIOS_CCCD])
                        {
                            locDescrValue.descrIndex = CY_BLE_AIOS_CCCD;
                        }
                        else if(cy_ble_aioscReqHandle[discIdx] ==
                                cy_ble_aiosConfigPtr->aiosc[discIdx].charInfoAddr[locCharIndex].charInfoPtr[j].
                                 descrHandle[CY_BLE_AIOS_CHAR_PRESENTATION_FORMAT])
                        {
                            locDescrValue.descrIndex = CY_BLE_AIOS_CHAR_PRESENTATION_FORMAT;
                        }
                        else if(cy_ble_aioscReqHandle[discIdx] ==
                                cy_ble_aiosConfigPtr->aiosc[discIdx].charInfoAddr[locCharIndex].charInfoPtr[j].
                                 descrHandle[CY_BLE_AIOS_CHAR_USER_DESCRIPTION_DESCR])
                        {
                            locDescrValue.descrIndex = CY_BLE_AIOS_CHAR_USER_DESCRIPTION_DESCR;
                        }
                        else if(cy_ble_aioscReqHandle[discIdx] ==
                                cy_ble_aiosConfigPtr->aiosc[discIdx].charInfoAddr[locCharIndex].charInfoPtr[j].
                                 descrHandle[CY_BLE_AIOS_CHAR_EXTENDED_PROPERTIES])
                        {
                            locDescrValue.descrIndex = CY_BLE_AIOS_CHAR_EXTENDED_PROPERTIES;
                        }
                        else if(cy_ble_aioscReqHandle[discIdx] ==
                                cy_ble_aiosConfigPtr->aiosc[discIdx].charInfoAddr[locCharIndex].charInfoPtr[j].
                                 descrHandle[CY_BLE_AIOS_VALUE_TRIGGER_SETTINGS])
                        {
                            locDescrValue.descrIndex = CY_BLE_AIOS_VALUE_TRIGGER_SETTINGS;
                        }
                        else if(cy_ble_aioscReqHandle[discIdx] ==
                                cy_ble_aiosConfigPtr->aiosc[discIdx].charInfoAddr[locCharIndex].charInfoPtr[j].
                                 descrHandle[CY_BLE_AIOS_TIME_TRIGGER_SETTINGS])
                        {
                            locDescrValue.descrIndex = CY_BLE_AIOS_TIME_TRIGGER_SETTINGS;
                        }
                        else if(cy_ble_aioscReqHandle[discIdx] ==
                                cy_ble_aiosConfigPtr->aiosc[discIdx].charInfoAddr[locCharIndex].charInfoPtr[j].
                                 descrHandle[CY_BLE_AIOS_VRD])
                        {
                            locDescrValue.descrIndex = CY_BLE_AIOS_VRD;
                        }
                        else if(cy_ble_aioscReqHandle[discIdx] ==
                                cy_ble_aiosConfigPtr->aiosc[discIdx].charInfoAddr[locCharIndex].charInfoPtr[j].
                                 descrHandle[CY_BLE_AIOS_NUM_OF_DIGITAL_DESCR])
                        {
                            locDescrValue.descrIndex = CY_BLE_AIOS_NUM_OF_DIGITAL_DESCR;
                        }
                        else
                        {
                            /* Should never enter here */
                        }


                        cy_ble_aioscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
                        Cy_BLE_AIOS_ApplCallback((uint32_t)CY_BLE_EVT_AIOSC_WRITE_DESCR_RESPONSE, &locDescrValue);
                        locReqHandle = 1u;
                    }
                }
            }
        }

