ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_aios.c
/******************************************************************************
* Function Name: Cy_BLE_AIOSC_SetCharacteristicDescriptor
***************************************************************************//**
*
*  This function is used to write the characteristic (which is identified by
*  charIndex) value attribute in the server. As a result a Write Request is
*  sent to the GATT Server and on successful execution of the request on the
*  Server side the CY_BLE_EVT_AIOSS_DESCR_WRITE events is generated.
*  On successful request execution on the Server side the Write Response is
*  sent to the Client.
*
*  Internally, Write Request is sent to the GATT Server and on successful
*  execution of the request on the Server side the following events can be
*  generated:
*  * CY_BLE_EVT_AIOSS_NOTIFICATION_ENABLED
*  * CY_BLE_EVT_AIOSS_NOTIFICATION_DISABLED
*  * CY_BLE_EVT_AIOSS_INDICATION_ENABLED
*  * CY_BLE_EVT_AIOSS_INDICATION_DISABLED
*
*  \param connHandle: The connection handle.
*  \param charIndex: The index of the service characteristic. Starts with zero.
*  \param descrIndex: The index of the service characteristic descriptor.
*  \param charInstance: The instance number of the characteristic specified by
*                "charIndex".
*  \param attrSize: The size of the characteristic value attribute.
*  \param attrValue: The pointer to the characteristic descriptor value data that
*             should be sent to the server device.
*
* \return
*  A return value is of type cy_en_ble_api_result_t.
*  * CY_BLE_SUCCESS - The request was sent successfully.
*  * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameters failed.
*  * CY_BLE_ERROR_INVALID_STATE - The state is not valid.
*  * CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED - Memory allocation failed.
*  * CY_BLE_ERROR_INVALID_OPERATION - This operation is not permitted on
*                                    the specified attribute.
*  * CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE - An optional Characteristic Descriptor
*                                              is absent.
*
* \events
*  In case of successful execution (return value = CY_BLE_SUCCESS)
*  the next events can appear: \n
*   If the AIOS service-specific callback is registered
*      (with Cy_BLE_AIOS_RegisterAttrCallback):
*  * CY_BLE_EVT_AIOSC_WRITE_DESCR_RESPONSE - in case if the requested attribute is
*                                successfully written on the peer device,
*                                the details (char index, descr index etc.) are
*                                provided with event parameter structure
*                                of type cy_stc_ble_aios_descr_value_t.
*  .
*   Otherwise (if the AIOS service-specific callback is not registered):
*  * CY_BLE_EVT_GATTC_WRITE_RSP - in case if the requested attribute is
*                                successfully written on the peer device.
*  * CY_BLE_EVT_GATTC_ERROR_RSP - in case if there is some trouble with the
*                                requested attribute on the peer device,
*                                the details are provided with event parameters
*                                structure (cy_stc_ble_gatt_err_param_t).
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_AIOSC_SetCharacteristicDescriptor(cy_stc_ble_conn_handle_t connHandle,
                                                                cy_en_ble_aios_char_index_t charIndex,
                                                                uint8_t charInstance,
                                                                cy_en_ble_aios_descr_index_t
                                                                descrIndex,
                                                                uint8_t attrSize,
                                                                uint8_t *attrValue)
{
    cy_en_ble_api_result_t apiResult;
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(connHandle);

    if(Cy_BLE_GetConnectionState(connHandle) != CY_BLE_CONN_STATE_CLIENT_DISCOVERED)
    {
        apiResult = CY_BLE_ERROR_INVALID_STATE;
    }
    else if((discIdx >= CY_BLE_CONFIG_GATTC_COUNT) ||
            (charIndex >= CY_BLE_AIOS_CHAR_COUNT) ||
            (charInstance >= cy_ble_aiosConfigPtr->aioscCharInstances[charIndex]) ||
            (descrIndex >= CY_BLE_AIOS_DESCR_COUNT))
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else if(cy_ble_aiosConfigPtr->aiosc[discIdx].charInfoAddr[charIndex].charInfoPtr[charInstance].descrHandle[descrIndex] ==
            CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
    {
        apiResult = CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE;
    }
    else if((descrIndex == CY_BLE_AIOS_CHAR_PRESENTATION_FORMAT) ||
            (descrIndex == CY_BLE_AIOS_CHAR_EXTENDED_PROPERTIES) ||
            (descrIndex == CY_BLE_AIOS_VRD) ||
            (descrIndex == CY_BLE_AIOS_NUM_OF_DIGITAL_DESCR))
    {
        apiResult = CY_BLE_ERROR_INVALID_OPERATION;
    }
    else
    {
        /* Fill all fields of write request structure ... */
        cy_stc_ble_gattc_write_req_t writeReqParam =
        {
            .handleValPair.attrHandle = cy_ble_aiosConfigPtr->aiosc[discIdx].charInfoAddr[charIndex].
                                         charInfoPtr[charInstance].descrHandle[descrIndex],
            .handleValPair.value.val  = attrValue,
            .handleValPair.value.len  = attrSize,
            .connHandle               = connHandle
        };
        /* ... and send request to server's device. */
        apiResult = Cy_BLE_GATTC_WriteCharacteristicDescriptors(&writeReqParam);

        /* Save handle to support service specific read response from device */
        if(apiResult == CY_BLE_SUCCESS)
        {
            cy_ble_aioscReqHandle[discIdx] = writeReqParam.handleValPair.attrHandle;
        }
    }
    
  
    return(apiResult);
}

/******************************************************************************
* Function Name: Cy_BLE_AIOSC_GetCharacteristicDescriptor
***************************************************************************//**
*
*  Sends a request to get the characteristic descriptor of the specified
*  characteristic of the service.
*
*  \param connHandle: The connection handle.
*  \param charIndex: The index of the service characteristic. Starts with zero.
*  \param charInstance: The instance number of the characteristic specified by
*                "charIndex".
*  \param descrIndex: The index of the service characteristic descriptor.
*
*  \return
*  * CY_BLE_SUCCESS - The request was sent successfully.
*  * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameters failed.
*  * CY_BLE_ERROR_INVALID_STATE - The state is not valid.
*  * CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED - Memory allocation failed.
*  * CY_BLE_ERROR_INVALID_OPERATION - This operation is not permitted on
*                                     the specified attribute.
*  * CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE - An optional Characteristic Descriptor
*                                              is absent.
*  \events
*  In case of successful execution (return value = CY_BLE_SUCCESS)
*  the next events can appear: \n
*  If the AIOS service-specific callback is registered
*      (with Cy_BLE_AIOS_RegisterAttrCallback):
*  * CY_BLE_EVT_AIOSC_READ_DESCR_RESPONSE - in case if the requested attribute is
*                                successfully written on the peer device,
*                                the details (char index, descr index, value, etc.)
*                                are provided with event parameter structure
*                                of type cy_stc_ble_aios_descr_value_t.
*  .
*  Otherwise (if the AIOS service-specific callback is not registered):
*  * CY_BLE_EVT_GATTC_READ_RSP - in case if the requested attribute is
*                                successfully read on the peer device,
*                                the details (handle, value, etc.) are
*                                provided with event parameters
*                                structure (cy_stc_ble_gattc_read_rsp_param_t).
*  * CY_BLE_EVT_GATTC_ERROR_RSP - in case if there is some trouble with the
*                                requested attribute on the peer device,
*                                the details are provided with event parameters
*                                structure (cy_stc_ble_gatt_err_param_t).
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_AIOSC_GetCharacteristicDescriptor(cy_stc_ble_conn_handle_t connHandle,
                                                                cy_en_ble_aios_char_index_t charIndex,
                                                                uint8_t charInstance,
                                                                cy_en_ble_aios_descr_index_t descrIndex)
{
    cy_en_ble_api_result_t apiResult;
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(connHandle);

        if(Cy_BLE_GetConnectionState(connHandle) != CY_BLE_CONN_STATE_CLIENT_DISCOVERED)
        {
            apiResult = CY_BLE_ERROR_INVALID_STATE;
        }
        else if((discIdx >= CY_BLE_CONFIG_GATTC_COUNT) ||
                (charIndex >= CY_BLE_AIOS_CHAR_COUNT) ||
                (charInstance >= cy_ble_aiosConfigPtr->aioscCharInstances[charIndex]) ||
                (descrIndex >= CY_BLE_AIOS_DESCR_COUNT))
        {
            apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
        }
        else if(cy_ble_aiosConfigPtr->aiosc[discIdx].charInfoAddr[charIndex].charInfoPtr[charInstance].descrHandle[descrIndex] ==
                CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
        {
            apiResult = CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE;
        }
        else
        {
            cy_stc_ble_gattc_read_req_t readReqParam =
            {
                .attrHandle = cy_ble_aiosConfigPtr->aiosc[discIdx].charInfoAddr[charIndex].charInfoPtr[charInstance].
                               descrHandle[descrIndex],
                .connHandle = connHandle,
            };
            apiResult = Cy_BLE_GATTC_ReadCharacteristicDescriptors(&readReqParam);


            /* Save handle to support service specific read response from device */
            if(apiResult == CY_BLE_SUCCESS)
            {
                cy_ble_aioscReqHandle[discIdx] = cy_ble_aiosConfigPtr->aiosc[discIdx].charInfoAddr[charIndex].
                                                  charInfoPtr[charInstance].descrHandle[descrIndex];
            }
        }


    return(apiResult);
}

